<!DOCTYPE html>
<html>
<head>
    <!-- head definitions go here -->
    <title>InspyreHelper Doc</title>
</head>
<body>

<h1>Documentation sur l'extension InspyreHelper (Version 0.10.1)</h1>
<div>
    <p>L&#39;extension InspyreHelper fonctionne sous Firefox (elle a &eacute;t&eacute; test&eacute;e sur la version 102
        de Firefox mais doit pouvoir fonctionner sur les versions pr&eacute;c&eacute;dentes).</p>
    <p>En cas de probl&egrave;me avec son fonctionnement, vous pouvez envoyer un mail &agrave;
        francois.deguibert@sdis78.fr, j&#39;essaierais de r&eacute;pondre le plus rapidement possible.</p>
</div>
<h2>Installation</h2>
<div>
    <p>Pour installer cette extension, merci de t&eacute;l&eacute;charger le fichier inspyrehelper-0.10.1.xpi en
        cliquant sur ce lien :
        <a href="https://github.com/fdeguibert/scriptPriseDeGarde.github.io/raw/main/resources/firefox_extension/web-ext-artifacts/inspyrehelper-0.10.1.xpi">inspyrehelper-0.10.1.xpi</a>
    </p>
    <p>Il vous suffit ensuite de double-cliquer dessus. Si Firefox est install&eacute;, l&#39;extension sera ajout&eacute;e
        &agrave; votre navigateur (une fen&ecirc;tre de confirmation devrait appara&icirc;tre).</p>
    <p>Les mises &agrave; jour de l&#39;extension seront automatiques.</p>
    <p>Note importante: l&#39;extension doit &ecirc;tre install&eacute;e sur chaque navigateur Firefox o&ugrave; vous
        souhaitez l&#39;utiliser.</p>
</div>
<h2>Fonctionnalit&eacute;s</h2>
<div>
    <p>Pour le moment cette extension ne permet qu&#39;une seule chose&nbsp;: g&eacute;n&eacute;rer le texte de la
        signature de fin de garde du CS Chevreuse.</p>
</div>
<h2>Mode d&#39;emploi</h2>
<div>
    <p>Une fois l&#39;extension install&eacute;e, rendez-vous sur la main courante et cliquez sur <img
            src="assets/SaisieDUneSignatureButton.png" alt="le bouton Saisie Signature"/></p>
</div>
<div>
    <h3>Utilisation</h3>
    <h4>Fonctionnement normal</h4>
    <p>Par d&eacute;faut, l&#39;extension va rechercher la derni&egrave;re signature de fin de garde &quot;valide&quot;
        (c&#39;est-&agrave;-dire dont le texte respecte le format standard de cette extension).</p>
    <p>Le format standard en question est le suivant: </p>
    <p style="font-family: 'Andale Mono',sans-serif">Consignes pass&eacute;es au Chef de Garde montant.<br>
        Interventions : [un nombre]<br>
        Infos : [un nombre]<br>
        Cumul interventions : [un nombre]<br>
        Cumul infos : [un nombre]<br>
        Personnel : [un mot ou texte]<br>
        Moyens : [un mot ou texte]<br>
        Divers : [un mot ou texte]<br></p>

    <p>L&#39;extension comptera ensuite le nombre d&#39;interventions et d&#39;informations depuis la derni&egrave;re
        signature valide et l&#39;ajoutera au total issu de la signature trouv&eacute;e.</p>
    <p>Le texte g&eacute;n&eacute;r&eacute; s&#39;affiche dans la fen&ecirc;tre de signature (pendant que l&#39;extension
        fait ses recherches, un message invitant &agrave; patienter est affich&eacute;, et le bouton d&#39;envoie de la
        signature est renomm&eacute; en &quot;Message incomplet&quot; et il est rendu inactif) :</p>
    <img src="assets/OngoingSimpleCalculation.png" alt="calcul simple en cours">
    <p>Une fois le texte g&eacute;n&eacute;r&eacute;, il n&#39;est toujours pas possible de valider la signature, car il
        faut ajouter les informations sur les lignes vides (Personnels, Moyens, Divers).</p>
    <img src="assets/invalidText.png" alt="message invalide">
    <p> Le texte peut &ecirc;tre n&#39;importe quoi, il faut juste qu&#39;il soit pr&eacute;sent. "RAS" par exemple s&#39;il
        n&#39;y a rien de sp&eacute;cial &agrave; indiquer.</p>
    <img src="assets/validText.png" alt="texte valide">
    <p>Quand les 2 lignes vides sont remplies, le bouton de validation est renomm&eacute; en &quot;Envoyer&quot;
        et il redevient actif afin de valider la signature.</p>
    <p>Note: il est toujours possible de modifier manuellement les chiffres fournis par l'extension avant de
        valider.</p>

    <h4>Fonctionnement avanc&eacute;</h4>
    <p>Pour diff&eacute;rentes raisons il peut &ecirc;tre n&eacute;cessaire de recompter les interventions et
        informations depuis le d&eacute;but de l&#39;ann&eacute;e.</p>
    <p>Par exemple, si c&#39;est la premi&egrave;re fois que l&#39;extension est utilis&eacute;e, elle peut ne pas
        trouver de signature valide dans l&#39;historique de la main courante (en pratique, le format standard est
        issu de message d&eacute;j&agrave; existant donc m&ecirc;me la premi&egrave;re fois que l&#39;extension est
        utilis&eacute;e elle devrait fonctionner en mode par d&eacute;faut)</p>
    <p>Un autre cas plus probable est s&#39;il y a eu des erreurs de comptage pendant l&#39;ann&eacute;e.</p>
    <p>Dans ce cas, il faut utiliser le bouton <img src="assets/reconstruireCumul.png" alt="Reconstruire Cumul"/> qui va
        recompter toutes les interventions et informations depuis le d&eacute;but de l&#39;ann&eacute;e.</p>
    <p>Cette action est un peu plus longue (quelques minutes).</p>
    <p>En cliquant sur le bouton, une fen&ecirc;tre de confirmation apparait:</p>
    <img src="assets/confirmationCumul.png" alt="Confirmation cumul"/>
    <p>Vous pouvez soit annuler l&#39;action, soit valider, auquel cas le calcul commence</p>
    <p>Pendant le calcul, la fen&ecirc;tre de signature affiche un message dynamique indiquant o&ugrave; en est le
        calcul et le bouton de validation de la signature continue d&#39;afficher &quot;Message Incomplet&quot; et reste
        inactif:</p>
    <img src="assets/OngoingCumulCalculation.png" alt="calcul en cours">
    <p>Une fois le calcul termin&eacute;, le message g&eacute;n&eacute;r&eacute;
        appara&icirc;t dans la fen&ecirc;tre et la marche &agrave; suivre est la m&ecirc;me que pour le fonctionnement
        par d&eacute;faut (renseigner un texte pour le Personnel et les Moyens)</p>

    <h3>Probl&egrave;mes possibles</h3>
    <h4>Actions correctives</h4>
    <p>J&#39;ai essay&eacute; de rendre cette extension la plus solide possible. Malheureusement, n&#39;ayant pas acc&egrave;s
        au code d&#39;inspyre les moyens sont limit&eacute;s et les probl&egrave;mes peuvent arriver.</p>
    <p>De mani&egrave;re g&eacute;n&eacute;rale, s&#39;il y a un probl&egrave;me (exemple&nbsp;: la fen&ecirc;tre de
        signature ne s&#39;affiche pas, ou le calcul ne se lance pas, ou un bouton n&#39;appara&icirc;t pas/reste
        inactif)</p>
    <p>la premi&egrave;re action &agrave; mener est de: <b>RECHARGER LA PAGE (touche F5 du clavier)</b></p>

    <p>Si cela ne r&eacute;sout pas le soucis et que &ccedil;a emp&egrave;che de remplir la signature de fin de garde, 3
        options:</p>
    <ul>
        <li>Soit le plus simple&nbsp;: utiliser un autre navigateur (Chrome, Internet Explorer, Edge, etc.) qui n&#39;a pas l&#39;extension install&eacute;e
            dessus.</li>
        <li>Soit utiliser un ordinateur du CS qui n&#39;a pas l&#39;extension install&eacute;e, soit la session windows
            de quelqu&#39;un d&#39;autre qui n&#39;a pas install&eacute; l&#39;extension ou bien un t&eacute;l&eacute;phone
            portable.
        </li>
        <li>Soit, plus compliqu&eacute;&nbsp;: d&eacute;sactiver l&#39;extension.</li>
        <p>Pour d&eacute;sactiver l&#39;extension, il faut se rendre dans le menu des extensions de firefox. Pour cela, cliquez  sur ce lien: <a
            href="about:addons">Menu des extensions</a> (ce lien peut ne pas marcher selon votre navigateur) <b>ou bien</b>
            rentrez dans la barre d&#39;adresse `about:addons` et valider:</p>
        <img src="assets/addonsMenu.png" alt="about:addons">
        <p>Puis trouvez l&#39;extension InspireHelper et cliquez sur le bouton de d&eacute;sactivation : </p>
        <img src="assets/disableExtension.png" alt="desactiver extension"/>
        <p>Puis revenez sur Inspyre et rechargez la page (touche F5). L&#39;extension &eacute;tant d&eacute;sactiv&eacute;e,
            vous reviendrez au fonctionnement &quot;standard&quot; d&#39;inspyre.</p>

        <p>IMPORTANT: merci de me pr&eacute;venir et de me d&eacute;crire le probl&egrave;me rencontr&eacute; afin que
            je puisse le corriger
            (contactez-moi directement, par Whatsapp, ou par mail : francois.deguibert@sdis78.fr</p>
    </ul>
    <h4>probl&egrave;mes connus et solutions</h4>
    <ul>
        <li><p>Lorsqu&#39;on lance un calcul du cumul depuis le d&eacute;but de l&#39;ann&eacute;e, puis qu&#39;on
            ferme la fen&egrave;tre de signature avant la fin, puis rouvre la fen&ecirc;tre, l&#39;extension ne se red&eacute;clenche
            plus</p>
            <p><b>Solution:</b> recharger la page (touche F5)</p>
        </li>
        <li>
            <p>Lorsqu&#39;on lance un calcul de cumul depuis le d&eacute;but de l&#39;ann&eacute;e, il arrive que la
                Main courante affiche le panneau &quot;Pas d&#39;&eacute;v&egrave;nements pour cette date.&quot; sous la fen&egrave;tre
                de signature (et que ce panneau reste, m&ecirc;me en fermant la fen&ecirc;tre de signature).</p>
            <img src="assets/NoEvent.png" alt="pas d evenements">
            <p><b>Explication:</b> l&#39;extension effectue une demande par jour &agrave; retrouver au serveur d&#39;inspyre.
                En milieu d&#39;ann&eacute;e, &ccedil;a repr&eacute;sente plusieurs centaines de requ&ecirc;tes et le serveur peut alors d&eacute;cider
                d&#39;arr&ecirc;ter de mettre &agrave; jour la main courante.<br>
                A priori, &ccedil;a n&#39;emp&egrave;che pas de valider la signature une fois le calcul du cumul termin&eacute;.
            </p>
            <p><b>Solution:</b> validez tout de m&ecirc;me la signature si vous le souhaitez, puis rechargez la page. Ou
                juste rechargez la page si vous avez ferm&eacute; la fen&ecirc;tre de signature.<br>
                Si jamais la signature n&#39;a pas &eacute;t&eacute; prise en compte, relancez le calcul du cumul,
                attendez la fin, copiez le texte g&eacute;n&eacute;r&eacute;, fermez la fen&ecirc;tre de signature et
                rechargez la page.<br>
                Puis rouvrez une fen&ecirc;tre de signature et collez le texte avant de valider.</p>
        </li>
    </ul>
</div>
<script></script>
</body>
</html>
